Долома/src/Documents/КонтрольнаяДойка/КонтрольнаяДойка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтрольнаяДойка</name>
  <registerRecords>InformationRegister.КонтрольныеНадои</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводСреднесуточногоУдоя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Животные</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>УдойУтро</name>
      <comment>Удой на контрольной дойке (в кг)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдойОбед</name>
      <comment>Удой на контрольной дойке (в кг)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдойВечер</name>
      <comment>Удой на контрольной дойке (в кг)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдойСуточный</name>
      <comment>Удой на контрольной дойке (в кг)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрошлыйСреднесуточный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/Documents/КонтрольнаяДойка/ManagerModule.bsl
&НаСервере
Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	
	//ЖИВОТНОЕ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Животное");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Животное   ");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Животные"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//УДОЙ УТРО
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"УдойУтро");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Удой (утро)        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//УДОЙ ДЕНЬ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"УдойОбед");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Удой (обед)        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//УДОЙ ДЕНЬ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"УдойВечер");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Удой (вечер)        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);

    //УДОЙ ДЕНЬ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"УдойСуточный");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Удой (суточный)        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	Возврат МассивПолейЗаполнения;
	
КонецФункции
